# Training
### (Used only for exploring data analysis!)

In [1]:
import pandas as pd
import numpy as np

In [ ]:
raw_data = {
    "Main_Profession": [
        "Programming",
        "Programming",
        "Data Analyst",
        "Data Analyst",
        "Cyber Security",
        "Electrical Engineer",
        "Electrical Engineer",
        "Electrical Engineer",
        "Electrical Engineer"
    ],
    "Salary": [
        2000,
        2300,
        2150,
        3250,
        4225,
        None,
        2421,
        1905,
        1905
    ],
    "Country": [
        "United States",
        "United States",
        "Canada",
        "Australia",
        "United States",
        "China",
        "China",
        "Canada",
        "Canada"
    ]
}

index = [
    "Aldo",
    "Nikki",
    "Acad",
    "Adit",
    "Ridwan",
    "Farhan",
    "Ruben",
    "Andre",
    "Andree"
]

data = pd.DataFrame(raw_data, index=index)

In [41]:
data

            Main_Profession  Salary        Country
Aldo            Programming  2000.0  United States
Nikki           Programming  2300.0  United States
Acad           Data Analyst  2150.0         Canada
Adit           Data Analyst  3250.0      Australia
Ridwan       Cyber Security  4225.0  United States
Farhan  Electrical Engineer     NaN          China
Ruben   Electrical Engineer  2421.0          China
Andre   Electrical Engineer  1905.0         Canada

In [42]:
data.dropna()

            Main_Profession  Salary        Country
Aldo            Programming  2000.0  United States
Nikki           Programming  2300.0  United States
Acad           Data Analyst  2150.0         Canada
Adit           Data Analyst  3250.0      Australia
Ridwan       Cyber Security  4225.0  United States
Ruben   Electrical Engineer  2421.0          China
Andre   Electrical Engineer  1905.0         Canada

In [43]:
data.drop_duplicates()

            Main_Profession  Salary        Country
Aldo            Programming  2000.0  United States
Nikki           Programming  2300.0  United States
Acad           Data Analyst  2150.0         Canada
Adit           Data Analyst  3250.0      Australia
Ridwan       Cyber Security  4225.0  United States
Farhan  Electrical Engineer     NaN          China
Ruben   Electrical Engineer  2421.0          China
Andre   Electrical Engineer  1905.0         Canada